<?xml version="1.0" ?>
<net name="LPRNet" version="11">
	<layers>
		<layer id="1" name="data" type="Parameter" version="opset1">
			<data shape="1,3,24,94" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="seq_ind" type="Parameter" version="opset1">
			<data shape="88,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="seq_ind"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="seq_ind">
					<dim>88</dim>
					<dim>1</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[C,N]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="2" name="76" type="Const" version="opset1">
			<data element_type="f32" shape="64, 3, 3, 3" offset="0" size="6912"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="76"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv1/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv1/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1/Dims768" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="6912" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv1/Dims768"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="relu_conv1" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_conv1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="pool1" type="MaxPool" version="opset8">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="ceil" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="pool1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="70" type="Const" version="opset1">
			<data element_type="f32" shape="32, 64, 1, 1" offset="7168" size="8192"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="70"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="fire1_small/conv_reduce/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_reduce/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="fire1_small/conv_reduce/Dims756" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="15360" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_reduce/Dims756"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="fire1_small/conv_reduce" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_reduce"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire1_small/conv_reduce">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="fire1_small/relu_conv_reduce" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/relu_conv_reduce"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire1_small/conv_reduce">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="64" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 1" offset="15488" size="12288"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="64"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="fire1_small/conv_3x1/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 0" pads_end="1, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_3x1/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="fire1_small/conv_3x1/Dims780" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="27776" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_3x1/Dims780"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="fire1_small/conv_3x1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_3x1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire1_small/conv_3x1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="fire1_small/relu_conv_3x1" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/relu_conv_3x1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire1_small/conv_3x1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="62" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 3" offset="27904" size="12288"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="62"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="fire1_small/conv_1x3/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_1x3/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="fire1_small/conv_1x3/Dims732" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="40192" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_1x3/Dims732"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="fire1_small/conv_1x3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_1x3"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire1_small/conv_1x3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="fire1_small/relu_conv_1x3" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/relu_conv_1x3"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire1_small/conv_1x3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="52" type="Const" version="opset1">
			<data element_type="f32" shape="128, 32, 1, 1" offset="40320" size="16384"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="52"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="fire1_small/conv_expand/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_expand/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="fire1_small/conv_expand/Dims750" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="56704" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_expand/Dims750"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="fire1_small/conv_expand" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/conv_expand"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire1_small/conv_expand">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="fire1_small/relu_conv_expand" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire1_small/relu_conv_expand"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire1_small/conv_expand">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="pool2" type="MaxPool" version="opset8">
			<data strides="2, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="ceil" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="pool2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="56" type="Const" version="opset1">
			<data element_type="f32" shape="64, 128, 1, 1" offset="57216" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="56"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="fire2_small/conv_reduce/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_reduce/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="fire2_small/conv_reduce/Dims792" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="89984" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_reduce/Dims792"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="fire2_small/conv_reduce" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_reduce"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire2_small/conv_reduce">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="fire2_small/relu_conv_reduce" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/relu_conv_reduce"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire2_small/conv_reduce">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="60" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 1" offset="90240" size="49152"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="60"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="fire2_small/conv_3x1/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 0" pads_end="1, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_3x1/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="fire2_small/conv_3x1/Dims798" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="139392" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_3x1/Dims798"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="fire2_small/conv_3x1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_3x1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire2_small/conv_3x1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="fire2_small/relu_conv_3x1" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/relu_conv_3x1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire2_small/conv_3x1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="74" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 1, 3" offset="139648" size="49152"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="74"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="fire2_small/conv_1x3/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_1x3/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="fire2_small/conv_1x3/Dims762" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="188800" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_1x3/Dims762"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="fire2_small/conv_1x3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_1x3"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire2_small/conv_1x3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="fire2_small/relu_conv_1x3" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/relu_conv_1x3"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire2_small/conv_1x3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="78" type="Const" version="opset1">
			<data element_type="f32" shape="256, 64, 1, 1" offset="189056" size="65536"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="78"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="fire2_small/conv_expand/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_expand/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="fire2_small/conv_expand/Dims744" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="254592" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_expand/Dims744"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="fire2_small/conv_expand" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/conv_expand"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire2_small/conv_expand">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="fire2_small/relu_conv_expand" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire2_small/relu_conv_expand"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire2_small/conv_expand">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="50" type="Const" version="opset1">
			<data element_type="f32" shape="64, 256, 1, 1" offset="255616" size="65536"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="50"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="fire3_small/conv_reduce/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_reduce/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="fire3_small/conv_reduce/Dims720" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="321152" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_reduce/Dims720"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="fire3_small/conv_reduce" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_reduce"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire3_small/conv_reduce">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="fire3_small/relu_conv_reduce" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/relu_conv_reduce"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire3_small/conv_reduce">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="54" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 1" offset="321408" size="49152"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="54"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="fire3_small/conv_3x1/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 0" pads_end="1, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_3x1/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="fire3_small/conv_3x1/Dims774" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="370560" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_3x1/Dims774"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="fire3_small/conv_3x1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_3x1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire3_small/conv_3x1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="fire3_small/relu_conv_3x1" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/relu_conv_3x1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire3_small/conv_3x1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="58" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 1, 3" offset="370816" size="49152"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="58"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="fire3_small/conv_1x3/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_1x3/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="fire3_small/conv_1x3/Dims726" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="419968" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_1x3/Dims726"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="fire3_small/conv_1x3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_1x3"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire3_small/conv_1x3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="fire3_small/relu_conv_1x3" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/relu_conv_1x3"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire3_small/conv_1x3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="46" type="Const" version="opset1">
			<data element_type="f32" shape="256, 64, 1, 1" offset="420224" size="65536"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="46"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="fire3_small/conv_expand/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_expand/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="fire3_small/conv_expand/Dims714" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="485760" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_expand/Dims714"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="fire3_small/conv_expand" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/conv_expand"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="fire3_small/conv_expand">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="fire3_small/relu_conv_expand" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="fire3_small/relu_conv_expand"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="fire3_small/conv_expand">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="pool3" type="MaxPool" version="opset8">
			<data strides="2, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="ceil" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="pool3"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>88</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="68" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256, 5, 1" offset="486784" size="655360"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="68"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv2/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="conv2/Dims804" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1142144" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2/Dims804"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="relu_conv2" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_conv2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="72" type="Const" version="opset1">
			<data element_type="f32" shape="71, 128, 1, 13" offset="1142656" size="472576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="72"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>71</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv3_w/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 6" pads_end="0, 6" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_w/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>71</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv3_w/Dims738" type="Const" version="opset1">
			<data element_type="f32" shape="1, 71, 1, 1" offset="1615232" size="284"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_w/Dims738"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv3_w" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_w"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_w">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="relu_conv3_w" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_conv3_w"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3_w">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="pattern/flatten_fc_input/value" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1615516" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="pattern/flatten_fc_input/value"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="pattern/flatten_fc_input" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="pattern/flatten_fc_input"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_w">
					<dim>1</dim>
					<dim>6248</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="pattern/weights_transpose" type="Const" version="opset1">
			<data element_type="f32" shape="128, 6248" offset="1615532" size="3198976"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="pattern/weights_transpose"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>6248</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="pattern/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="pattern/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>6248</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="67" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="4814508" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="67"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="pattern" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="pattern"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="pattern">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="80" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4815020" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="80"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="reshape"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="reshape">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="tile/tiles10742888" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4815052" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="tile/tiles10742888"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="tile1072" type="Tile" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="tile1072"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="tile">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="concat" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="concat"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="concat">
					<dim>1</dim>
					<dim>199</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="48" type="Const" version="opset1">
			<data element_type="f32" shape="71, 199, 1, 1" offset="4815084" size="56516"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="48"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>71</dim>
					<dim>199</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="result/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="result/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>199</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>71</dim>
					<dim>199</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
