<?xml version="1.0" ?>
<net name="frozen_model" version="10">
	<layers>
		<layer id="0" name="Placeholder_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 1, 512, 680"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Placeholder" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 3, 512, 680"/>
			<output>
				<port id="0" names="Placeholder:0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="truediv/y" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1, 1, 1, 1" size="4"/>
			<output>
				<port id="0" names="truediv/y:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="truediv" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="truediv:0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="sub/y" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="1, 1, 1, 1" size="4"/>
			<output>
				<port id="0" names="sub/y:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="sub" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="sub:0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="sub_1/x" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="1, 1, 1, 1" size="4"/>
			<output>
				<port id="0" names="sub_1/x:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="sub_1/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="2" names="sub_1:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="2" names="mul:0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="ones_like/Const" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="" size="4"/>
			<output>
				<port id="0" names="ones_like/Const:0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="ones_like/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="ones_like/Shape/GatherNCHWtoNHWC_input_port_1/value939314465" type="Const" version="opset1">
			<data element_type="i32" offset="12" shape="4" size="16"/>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="ones_like/Shape/GatherNCHWtoNHWC_input_port_2/value939514771" type="Const" version="opset1">
			<data element_type="i64" offset="28" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="13" name="ones_like/Shape/GatherNCHWtoNHWC" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="ones_like/Broadcast/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" names="ones_like/Shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="ones_like/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="ones_like:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="36" shape="4" size="32"/>
			<output>
				<port id="0" names="strided_slice/stack:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="68" shape="4" size="32"/>
			<output>
				<port id="0" names="strided_slice/stack_1:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="100" shape="4" size="32"/>
			<output>
				<port id="0" names="strided_slice/stack_2:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 0" ellipsis_mask="0, 0, 0, 0" end_mask="1, 1, 1, 0" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="981214381" type="Const" version="opset1">
			<data element_type="i64" offset="132" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="concat/TransposeNHWCtoNCHW" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="980014741" type="Const" version="opset1">
			<data element_type="i64" offset="132" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="mul_1/TransposeNHWCtoNCHW" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="strided_slice:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="2" names="mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="3" names="concat:0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="inpaint_net/b1conv1/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="164" shape="32, 5, 7, 7" size="31360"/>
			<output>
				<port id="0" names="inpaint_net/b1conv1/kernel/read:0" precision="FP32">
					<dim>32</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="inpaint_net/b1conv1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv1/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="inpaint_net/b1conv1/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="31524" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" names="inpaint_net/b1conv1/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="inpaint_net/b1conv1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv1/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="inpaint_net/b1conv1/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv1/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="inpaint_net/b1conv2_downsample/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="31652" shape="64, 32, 7, 7" size="401408"/>
			<output>
				<port id="0" names="inpaint_net/b1conv2_downsample/kernel/read:0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="inpaint_net/b1conv2_downsample/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="2, 2" pads_end="3, 3" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv2_downsample/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="inpaint_net/b1conv2_downsample/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="433060" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" names="inpaint_net/b1conv2_downsample/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="inpaint_net/b1conv2_downsample/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv2_downsample/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="inpaint_net/b1conv2_downsample/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv2_downsample/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="inpaint_net/b1conv3/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="433316" shape="64, 64, 7, 7" size="802816"/>
			<output>
				<port id="0" names="inpaint_net/b1conv3/kernel/read:0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="inpaint_net/b1conv3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv3/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="inpaint_net/b1conv3/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="1236132" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" names="inpaint_net/b1conv3/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="inpaint_net/b1conv3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv3/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="inpaint_net/b1conv3/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv3/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="inpaint_net/b1conv4_downsample/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="1236388" shape="128, 64, 7, 7" size="1605632"/>
			<output>
				<port id="0" names="inpaint_net/b1conv4_downsample/kernel/read:0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="inpaint_net/b1conv4_downsample/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="2, 2" pads_end="3, 3" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv4_downsample/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="inpaint_net/b1conv4_downsample/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="2842020" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="inpaint_net/b1conv4_downsample/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="inpaint_net/b1conv4_downsample/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv4_downsample/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="inpaint_net/b1conv4_downsample/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv4_downsample/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="inpaint_net/b1conv5/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="2842532" shape="128, 128, 7, 7" size="3211264"/>
			<output>
				<port id="0" names="inpaint_net/b1conv5/kernel/read:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="inpaint_net/b1conv5/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv5/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="inpaint_net/b1conv5/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="6053796" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="inpaint_net/b1conv5/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="inpaint_net/b1conv5/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv5/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="inpaint_net/b1conv5/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv5/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="inpaint_net/b1conv6/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="6054308" shape="128, 128, 7, 7" size="3211264"/>
			<output>
				<port id="0" names="inpaint_net/b1conv6/kernel/read:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="inpaint_net/b1conv6/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv6/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="inpaint_net/b1conv6/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="9265572" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="inpaint_net/b1conv6/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="inpaint_net/b1conv6/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv6/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="inpaint_net/b1conv6/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv6/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="inpaint_net/b1conv7_atrous/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="9266084" shape="128, 128, 7, 7" size="3211264"/>
			<output>
				<port id="0" names="inpaint_net/b1conv7_atrous/kernel/read:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="inpaint_net/b1conv7_atrous/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="2, 2" pads_begin="6, 6" pads_end="6, 6" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv7_atrous/BatchToSpaceND:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="inpaint_net/b1conv7_atrous/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="12477348" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="inpaint_net/b1conv7_atrous/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="inpaint_net/b1conv7_atrous/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv7_atrous/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="inpaint_net/b1conv7_atrous/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv7_atrous/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="inpaint_net/b1conv8_atrous/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="12477860" shape="128, 128, 7, 7" size="3211264"/>
			<output>
				<port id="0" names="inpaint_net/b1conv8_atrous/kernel/read:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="inpaint_net/b1conv8_atrous/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="4, 4" pads_begin="12, 12" pads_end="12, 12" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv8_atrous/BatchToSpaceND:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="inpaint_net/b1conv8_atrous/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="15689124" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="inpaint_net/b1conv8_atrous/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="inpaint_net/b1conv8_atrous/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv8_atrous/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="inpaint_net/b1conv8_atrous/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv8_atrous/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="inpaint_net/b1conv9_atrous/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="15689636" shape="128, 128, 7, 7" size="3211264"/>
			<output>
				<port id="0" names="inpaint_net/b1conv9_atrous/kernel/read:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="inpaint_net/b1conv9_atrous/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="8, 8" pads_begin="24, 24" pads_end="24, 24" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv9_atrous/BatchToSpaceND:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="inpaint_net/b1conv9_atrous/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="18900900" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="inpaint_net/b1conv9_atrous/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="inpaint_net/b1conv9_atrous/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv9_atrous/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="inpaint_net/b1conv9_atrous/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv9_atrous/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="inpaint_net/b1conv10_atrous/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="18901412" shape="128, 128, 7, 7" size="3211264"/>
			<output>
				<port id="0" names="inpaint_net/b1conv10_atrous/kernel/read:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="inpaint_net/b1conv10_atrous/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="16, 16" pads_begin="48, 48" pads_end="48, 48" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv10_atrous/BatchToSpaceND:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="inpaint_net/b1conv10_atrous/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="22112676" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="inpaint_net/b1conv10_atrous/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="inpaint_net/b1conv10_atrous/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv10_atrous/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="inpaint_net/b1conv10_atrous/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv10_atrous/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="inpaint_net/b1conv11/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="22113188" shape="128, 128, 7, 7" size="3211264"/>
			<output>
				<port id="0" names="inpaint_net/b1conv11/kernel/read:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="inpaint_net/b1conv11/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv11/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="inpaint_net/b1conv11/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="25324452" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="inpaint_net/b1conv11/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="inpaint_net/b1conv11/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv11/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="inpaint_net/b1conv11/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv11/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="inpaint_net/b1conv12/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="25324964" shape="128, 128, 7, 7" size="3211264"/>
			<output>
				<port id="0" names="inpaint_net/b1conv12/kernel/read:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="inpaint_net/b1conv12/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv12/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="inpaint_net/b1conv12/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="28536228" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="inpaint_net/b1conv12/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="inpaint_net/b1conv12/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b1conv12/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="inpaint_net/b1conv12/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b1conv12/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="inpaint_net/b3conv1/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="28536740" shape="32, 5, 5, 5" size="16000"/>
			<output>
				<port id="0" names="inpaint_net/b3conv1/kernel/read:0" precision="FP32">
					<dim>32</dim>
					<dim>5</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="inpaint_net/b3conv1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>5</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b3conv1/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="inpaint_net/b3conv1/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="28552740" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" names="inpaint_net/b3conv1/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="inpaint_net/b3conv1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b3conv1/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="inpaint_net/b3conv1/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b3conv1/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="inpaint_net/b3conv2_downsample/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="28552868" shape="64, 32, 3, 3" size="73728"/>
			<output>
				<port id="0" names="inpaint_net/b3conv2_downsample/kernel/read:0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="inpaint_net/b3conv2_downsample/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b3conv2_downsample/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="inpaint_net/b3conv2_downsample/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="28626596" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" names="inpaint_net/b3conv2_downsample/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="inpaint_net/b3conv2_downsample/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b3conv2_downsample/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="inpaint_net/b3conv2_downsample/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b3conv2_downsample/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="inpaint_net/b3conv3/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="28626852" shape="64, 64, 3, 3" size="147456"/>
			<output>
				<port id="0" names="inpaint_net/b3conv3/kernel/read:0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="inpaint_net/b3conv3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b3conv3/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="inpaint_net/b3conv3/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="28774308" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" names="inpaint_net/b3conv3/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="inpaint_net/b3conv3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b3conv3/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="inpaint_net/b3conv3/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b3conv3/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="inpaint_net/b3conv4_downsample/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="28774564" shape="128, 64, 3, 3" size="294912"/>
			<output>
				<port id="0" names="inpaint_net/b3conv4_downsample/kernel/read:0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="inpaint_net/b3conv4_downsample/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b3conv4_downsample/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="inpaint_net/b3conv4_downsample/bias/read" type="Const" version="opset1">
			<data element_type="f32" offset="29069476" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="inpaint_net/b3conv4_downsample/bias/read:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="inpaint_net/b3conv4_downsample/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="inpaint_net/b3conv4_downsample/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="inpaint_net/b3conv4_downsample/Elu" type="Elu" version="opset1">
			<data alpha="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" names="inpaint_net/b3conv4_downsample/Elu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="inpaint_net/b3conv5/kernel/read" type="Const" version="opset1">
			<data element_type="f32" offset="29069988" shape="128, 128, 3, 3" size="589824"/>
			<output>
				<port id="0" names="inpaint_net/b3conv5/kernel/read:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="inpaint_net/b3conv5/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
