<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="1" name="input.1" type="Parameter" version="opset1">
			<data shape="1" element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input.1"/>
				<attribute name="old_api_map_element_type" version="0" value="i32"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input.1">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="input.2" type="Parameter" version="opset1">
			<data shape="1" element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input.2"/>
				<attribute name="old_api_map_element_type" version="0" value="i32"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input.2">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="emb_e.weight" type="Const" version="opset1">
			<data element_type="f32" shape="271, 300" offset="0" size="325200"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="emb_e.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="emb_e.weight">
					<dim>271</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_20" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="325200" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_20"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="4" name="26" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="26"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>271</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="26">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="27" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="325208" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="27"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="27">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="28" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="28"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="28">
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="emb_rel.weight" type="Const" version="opset1">
			<data element_type="f32" shape="4, 300" offset="325240" size="4800"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="emb_rel.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="emb_rel.weight">
					<dim>4</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_29" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="325200" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_29"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="9" name="29" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="29"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="29">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="30" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="325208" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="30"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="30">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="31" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="31"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="31">
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="32" type="Concat" version="opset1">
			<data axis="2"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="32"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>20</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_1036" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="330040" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="33, bn0.bias, bn0.running_mean, bn0.running_var, bn0.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Multiply_1166" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="33, bn0.bias, bn0.running_mean, bn0.running_var, bn0.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>20</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>20</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_1171" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="330044" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="33" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="33, bn0.bias, bn0.running_mean, bn0.running_var, bn0.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>20</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="33">
					<dim>1</dim>
					<dim>1</dim>
					<dim>20</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Multiply_1190" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 3, 3" offset="330048" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Multiply_1176" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="34, 35, Concat_59, Convolution_40, Reshape_60, bn1.bias, bn1.running_mean, bn1.running_var, bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>20</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_1181" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="331200" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="35" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="34, 35, Concat_59, Reshape_60, bn1.bias, bn1.running_mean, bn1.running_var, bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="35">
					<dim>1</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="36" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="36"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="36">
					<dim>1</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="37" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="331328" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="37"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="37">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="38" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="38"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="38">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="fc.weight" type="Const" version="opset1">
			<data element_type="f32" shape="300, 16128" offset="331344" size="19353600"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="fc.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="fc.weight">
					<dim>300</dim>
					<dim>16128</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="MatMul_99" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MatMul_99"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>300</dim>
					<dim>16128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_1240" type="Const" version="opset1">
			<data element_type="f32" shape="1, 300" offset="19684944" size="1200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="39" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="39, Multiply_100"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="39">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_102" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="19686144" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_102"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="50" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="41, 42, 43, 45, 46, 48, 49, 50"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="50">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_1241" type="Const" version="opset1">
			<data element_type="f32" shape="1, 300" offset="19686152" size="1200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="51" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="51"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="51">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_1242" type="Const" version="opset1">
			<data element_type="f32" shape="1, 300" offset="19687352" size="1200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="52" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="52"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="52">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="53" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="53"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="53">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="MatMul_119" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="54, MatMul_119, Multiply_120"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>271</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="54">
					<dim>1</dim>
					<dim>271</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_1243" type="Const" version="opset1">
			<data element_type="f32" shape="1, 271" offset="19688552" size="1084"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>271</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="57" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="56"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>271</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>271</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="57">
					<dim>1</dim>
					<dim>271</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="58" type="SoftMax" version="opset8">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="58"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>271</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="58">
					<dim>1</dim>
					<dim>271</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="58/sink_port_0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="58/sink_port_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>271</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="9" to-port="1"/>
		<edge from-layer="1" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="2" from-port="0" to-layer="35" to-port="1"/>
		<edge from-layer="2" from-port="0" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="2"/>
		<edge from-layer="4" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="7" from-port="0" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="0" to-layer="9" to-port="2"/>
		<edge from-layer="9" from-port="3" to-layer="11" to-port="0"/>
		<edge from-layer="10" from-port="0" to-layer="11" to-port="1"/>
		<edge from-layer="11" from-port="2" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="0" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="0" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="23" to-port="0"/>
		<edge from-layer="22" from-port="0" to-layer="23" to-port="1"/>
		<edge from-layer="23" from-port="2" to-layer="25" to-port="0"/>
		<edge from-layer="24" from-port="0" to-layer="25" to-port="1"/>
		<edge from-layer="25" from-port="2" to-layer="27" to-port="0"/>
		<edge from-layer="26" from-port="0" to-layer="27" to-port="1"/>
		<edge from-layer="27" from-port="2" to-layer="29" to-port="0"/>
		<edge from-layer="28" from-port="0" to-layer="29" to-port="1"/>
		<edge from-layer="29" from-port="2" to-layer="31" to-port="0"/>
		<edge from-layer="30" from-port="0" to-layer="31" to-port="1"/>
		<edge from-layer="31" from-port="2" to-layer="33" to-port="0"/>
		<edge from-layer="32" from-port="0" to-layer="33" to-port="1"/>
		<edge from-layer="33" from-port="2" to-layer="34" to-port="0"/>
		<edge from-layer="34" from-port="1" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="2" to-layer="37" to-port="0"/>
		<edge from-layer="36" from-port="0" to-layer="37" to-port="1"/>
		<edge from-layer="37" from-port="2" to-layer="38" to-port="0"/>
		<edge from-layer="38" from-port="1" to-layer="39" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2022.1.0-7019-cdb9bec7210-releases/2022/1"/>
		<Runtime_version value="2022.1.0-7019-cdb9bec7210-releases/2022/1"/>
		<legacy_path value="False"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<compress_fp16 value="False"/>
			<data_type value="FP32"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{}"/>
			<input value="input.1,input.2"/>
			<input_model value="DIR/conve_fp32.onnx"/>
			<input_model_is_text value="False"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<layout value="()"/>
			<layout_values value="{}"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="conve_fp32"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="{'input.1': (1,), 'input.2': (1,)}"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<source_layout value="()"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<target_layout value="()"/>
			<transform value=""/>
			<use_legacy_frontend value="False"/>
			<use_new_frontend value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, finegrain_fusing, input_checkpoint, input_meta_graph, input_proto, input_shape, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, output, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
