<?xml version="1.0" ?>
<net name="monai-model" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1, 1, 96, 96" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="input.1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="model.0.conv.unit0.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 3, 3" offset="0" size="288"/>
			<output>
				<port id="0" precision="FP16" names="model.0.conv.unit0.conv.weight">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_1/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_1/Dims2817" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="288" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="65">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="InstanceNormalization_4/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="320" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="6" name="InstanceNormalization_4/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="InstanceNormalization_4/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="InstanceNormalization_4/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="328" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="InstanceNormalization_4/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="10" name="InstanceNormalization_4/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="336" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="11" name="InstanceNormalization_4/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="InstanceNormalization_4/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_2" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="344" size="32"/>
			<output>
				<port id="0" precision="FP16" names="66">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="InstanceNormalization_4/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_3" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="376" size="32"/>
			<output>
				<port id="0" precision="FP16" names="67">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="InstanceNormalization_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="68">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="185" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="408" size="4"/>
			<output>
				<port id="0" precision="FP32" names="185">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="PRelu_5" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="70">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model.0.conv.unit1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 3, 3" offset="412" size="4608"/>
			<output>
				<port id="0" precision="FP16" names="model.0.conv.unit1.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_6/Dims2787" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="5020" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="71">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="InstanceNormalization_9/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="320" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="24" name="InstanceNormalization_9/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="InstanceNormalization_9/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="InstanceNormalization_9/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="328" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="InstanceNormalization_9/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="28" name="InstanceNormalization_9/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="336" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="29" name="InstanceNormalization_9/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="InstanceNormalization_9/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_7" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="344" size="32"/>
			<output>
				<port id="0" precision="FP16" names="72">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="InstanceNormalization_9/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_8" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="376" size="32"/>
			<output>
				<port id="0" precision="FP16" names="73">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="InstanceNormalization_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="74">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="186" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="5052" size="4"/>
			<output>
				<port id="0" precision="FP32" names="186">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="PRelu_10" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="76">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model.0.residual.weight" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 3, 3" offset="5056" size="288"/>
			<output>
				<port id="0" precision="FP16" names="model.0.residual.weight">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_0/Dims2847" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="5344" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Add_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="77">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model.1.submodule.0.conv.unit0.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 3, 3" offset="5376" size="9216"/>
			<output>
				<port id="0" precision="FP16" names="model.1.submodule.0.conv.unit0.conv.weight">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_13/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_13/Dims2763" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="14592" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="79">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="InstanceNormalization_16/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="320" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="47" name="InstanceNormalization_16/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="InstanceNormalization_16/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="InstanceNormalization_16/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="328" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="InstanceNormalization_16/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="51" name="InstanceNormalization_16/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="336" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="52" name="InstanceNormalization_16/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="InstanceNormalization_16/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_14" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="14656" size="64"/>
			<output>
				<port id="0" precision="FP16" names="80">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="InstanceNormalization_16/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_15" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="14720" size="64"/>
			<output>
				<port id="0" precision="FP16" names="81">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="InstanceNormalization_16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="82">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="187" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="14784" size="4"/>
			<output>
				<port id="0" precision="FP32" names="187">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="PRelu_17" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="84">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model.1.submodule.0.conv.unit1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="14788" size="18432"/>
			<output>
				<port id="0" precision="FP16" names="model.1.submodule.0.conv.unit1.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_18/Dims2883" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="33220" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="85">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="InstanceNormalization_21/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="320" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="65" name="InstanceNormalization_21/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="InstanceNormalization_21/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="InstanceNormalization_21/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="328" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="InstanceNormalization_21/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="69" name="InstanceNormalization_21/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="336" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="70" name="InstanceNormalization_21/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="InstanceNormalization_21/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_19" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="14656" size="64"/>
			<output>
				<port id="0" precision="FP16" names="86">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="InstanceNormalization_21/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_20" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="14720" size="64"/>
			<output>
				<port id="0" precision="FP16" names="87">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="InstanceNormalization_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="88">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="188" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="33284" size="4"/>
			<output>
				<port id="0" precision="FP32" names="188">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="PRelu_22" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="90">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="model.1.submodule.0.residual.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 3, 3" offset="33288" size="9216"/>
			<output>
				<port id="0" precision="FP16" names="model.1.submodule.0.residual.weight">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_12/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_12/Dims2871" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="42504" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="78">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Add_23" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="91">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="model.1.submodule.1.submodule.0.conv.unit0.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 3, 3" offset="42568" size="36864"/>
			<output>
				<port id="0" precision="FP16" names="model.1.submodule.1.submodule.0.conv.unit0.conv.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_25/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_25/Dims2757" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="79432" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_25" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="93">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="InstanceNormalization_28/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="320" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="88" name="InstanceNormalization_28/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="InstanceNormalization_28/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="InstanceNormalization_28/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="328" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="InstanceNormalization_28/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="92" name="InstanceNormalization_28/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="336" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="93" name="InstanceNormalization_28/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="InstanceNormalization_28/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_26" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="79560" size="128"/>
			<output>
				<port id="0" precision="FP16" names="94">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="InstanceNormalization_28/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_27" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="79688" size="128"/>
			<output>
				<port id="0" precision="FP16" names="95">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="InstanceNormalization_28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="96">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="189" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="79816" size="4"/>
			<output>
				<port id="0" precision="FP32" names="189">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="PRelu_29" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="98">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="model.1.submodule.1.submodule.0.conv.unit1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="79820" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="model.1.submodule.1.submodule.0.conv.unit1.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_30/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_30/Dims2811" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="153548" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_30" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="99">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="InstanceNormalization_33/Range_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="320" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="106" name="InstanceNormalization_33/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="InstanceNormalization_33/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="InstanceNormalization_33/Rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="328" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="InstanceNormalization_33/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="110" name="InstanceNormalization_33/Range_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="336" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="111" name="InstanceNormalization_33/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="InstanceNormalization_33/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_31" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="79560" size="128"/>
			<output>
				<port id="0" precision="FP16" names="100">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="InstanceNormalization_33/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_32" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="79688" size="128"/>
			<output>
				<port id="0" precision="FP16" names="101">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="InstanceNormalization_33" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="102">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="190" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="153676" size="4"/>
			<output>
				<port id="0" precision="FP32" names="190">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="PRelu_34" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="104">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="model.1.submodule.1.submodule.0.residual.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 3, 3" offset="153680" size="36864"/>
			<output>
				<port id="0" precision="FP16" names="model.1.submodule.1.submodule.0.residual.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Conv_24/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Conv_24/Dims2853" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="190544" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Conv_24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="92">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Add_35" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="105">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="model.1.submodule.1.submodule.1.submodule.0.conv.unit0.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 3, 3" offset="190672" size="147456"/>
			<output>
				<port id="0" precision="FP16" names="model.1.submodule.1.submodule.1.submodule.0.conv.unit0.conv.weight">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Conv_37/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Conv_37/Dims2799" type="Const" version="opset1">
