<?xml version="1.0" ?>
<net name="pretrained_unet_kits19" version="10">
	<layers>
		<layer id="0" name="147114756217" type="Const" version="opset1">
			<data offset="0" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="1" name="147214766802" type="Const" version="opset1">
			<data offset="2" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="2" name="147314776982" type="Const" version="opset1">
			<data offset="0" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="3" name="147414786697" type="Const" version="opset1">
			<data offset="2" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="InstanceNormalization_68/Range_input_port_0/value6907189" type="Const" version="opset1">
			<data offset="4" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="5" name="145114556565" type="Const" version="opset1">
			<data offset="12" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="6" name="145214567246" type="Const" version="opset1">
			<data offset="14" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="7" name="145314576868" type="Const" version="opset1">
			<data offset="12" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="8" name="145414586418" type="Const" version="opset1">
			<data offset="14" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="9" name="InstanceNormalization_65/Range_input_port_0/value6726463" type="Const" version="opset1">
			<data offset="4" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="10" name="231123156568" type="Const" version="opset1">
			<data offset="16" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="11" name="231223167225" type="Const" version="opset1">
			<data offset="18" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="12" name="231323177069" type="Const" version="opset1">
			<data offset="16" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="13" name="231423186343" type="Const" version="opset1">
			<data offset="18" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="14" name="InstanceNormalization_4/Range_input_port_0/value3786370" type="Const" version="opset1">
			<data offset="4" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="15" name="163116356412" type="Const" version="opset1">
			<data offset="20" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="16" name="163216366316" type="Const" version="opset1">
			<data offset="22" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="17" name="163316377066" type="Const" version="opset1">
			<data offset="20" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="18" name="163416386628" type="Const" version="opset1">
			<data offset="22" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="19" name="InstanceNormalization_1/Range_input_port_0/value3606727" type="Const" version="opset1">
			<data offset="4" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="20" name="140114056985" type="Const" version="opset1">
			<data offset="24" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="21" name="140214067135" type="Const" version="opset1">
			<data offset="26" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="22" name="140314077042" type="Const" version="opset1">
			<data offset="24" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="23" name="140414086748" type="Const" version="opset1">
			<data offset="26" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="24" name="input.1" type="Parameter" version="opset1">
			<data shape="1,1,512,512" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="input.1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_0/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv_0.conv_0.conv.weight3563586/quantized44836415" type="Const" version="opset1">
			<data offset="28" size="288" shape="32,1,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv_0.conv_0.conv.weight3563586/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_0/WithoutBiases/fq_weights_1/zero_point45026916" type="Const" version="opset1">
			<data offset="316" size="64" shape="32,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_0/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_0/WithoutBiases/fq_weights_1/scale44917114" type="Const" version="opset1">
			<data offset="380" size="64" shape="32,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_0/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_0/Dims26873586358" type="Const" version="opset1">
			<data offset="444" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="83">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="InstanceNormalization_1/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="InstanceNormalization_1/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="InstanceNormalization_1/Rank/0d_rank_of/value3636613" type="Const" version="opset1">
			<data offset="508" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="InstanceNormalization_1/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="39" name="InstanceNormalization_1/Range_input_port_2/value3656955" type="Const" version="opset1">
			<data offset="516" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="40" name="InstanceNormalization_1/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0"/>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="117111756262" type="Const" version="opset1">
			<data offset="524" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="42" name="117211767147" type="Const" version="opset1">
			<data offset="526" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="43" name="117311776274" type="Const" version="opset1">
			<data offset="524" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="44" name="117411786295" type="Const" version="opset1">
			<data offset="526" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="45" name="InstanceNormalization_1/Ins_Norm/MVN_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="InstanceNormalization_1/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.999999747378752e-06" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv_0.conv_0.adn.N.weight3686661" type="Const" version="opset1">
			<data offset="528" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="conv_0.conv_0.adn.N.weight">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="InstanceNormalization_1/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="conv_0.conv_0.adn.N.bias3707030" type="Const" version="opset1">
			<data offset="592" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="conv_0.conv_0.adn.N.bias">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="InstanceNormalization_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="84">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="LeakyRelu_2/weights702811056372" type="Const" version="opset1">
			<data offset="656" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="LeakyRelu_2" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="85">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_3/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="conv_0.conv_1.conv.weight3743594/quantized44236853" type="Const" version="opset1">
			<data offset="660" size="9216" shape="32,32,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv_0.conv_1.conv.weight3743594/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_3/WithoutBiases/fq_weights_1/zero_point44427087" type="Const" version="opset1">
			<data offset="9876" size="64" shape="32,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_3/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_3/WithoutBiases/fq_weights_1/scale44317006" type="Const" version="opset1">
			<data offset="9940" size="64" shape="32,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_3/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_3/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_3/Dims27713766871" type="Const" version="opset1">
			<data offset="10004" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="86">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="InstanceNormalization_4/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="InstanceNormalization_4/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="InstanceNormalization_4/Rank/0d_rank_of/value3816814" type="Const" version="opset1">
			<data offset="508" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="InstanceNormalization_4/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="67" name="InstanceNormalization_4/Range_input_port_2/value3836841" type="Const" version="opset1">
			<data offset="516" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="68" name="InstanceNormalization_4/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0"/>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="132113256619" type="Const" version="opset1">
			<data offset="10068" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="70" name="132213266331" type="Const" version="opset1">
			<data offset="10070" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="71" name="132313276655" type="Const" version="opset1">
			<data offset="10068" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="72" name="132413286475" type="Const" version="opset1">
			<data offset="10070" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="73" name="InstanceNormalization_4/Ins_Norm/MVN_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="InstanceNormalization_4/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.999999747378752e-06" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="conv_0.conv_1.adn.N.weight3866376" type="Const" version="opset1">
			<data offset="10072" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="conv_0.conv_1.adn.N.weight">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="InstanceNormalization_4/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv_0.conv_1.adn.N.bias3886940" type="Const" version="opset1">
			<data offset="10136" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="conv_0.conv_1.adn.N.bias">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="InstanceNormalization_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="87">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="LeakyRelu_5/weights705210960390" type="Const" version="opset1">
			<data offset="656" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="LeakyRelu_5" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="88">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Concat_63/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="232123257099" type="Const" version="opset1">
			<data offset="10200" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="83" name="232223266253" type="Const" version="opset1">
			<data offset="10202" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="84" name="232323276826" type="Const" version="opset1">
			<data offset="10200" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="85" name="232423286706" type="Const" version="opset1">
			<data offset="10202" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="86" name="176117656334" type="Const" version="opset1">
			<data offset="10204" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="87" name="176217666862" type="Const" version="opset1">
			<data offset="10206" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="88" name="176317676772" type="Const" version="opset1">
			<data offset="10204" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="89" name="176417686346" type="Const" version="opset1">
			<data offset="10206" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="90" name="InstanceNormalization_59/Range_input_port_0/value6497210" type="Const" version="opset1">
			<data offset="4" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="91" name="143114356373" type="Const" version="opset1">
			<data offset="10208" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="92" name="143214366730" type="Const" version="opset1">
			<data offset="10210" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="93" name="143314376754" type="Const" version="opset1">
			<data offset="10208" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="94" name="143414386856" type="Const" version="opset1">
			<data offset="10210" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="95" name="InstanceNormalization_56/Range_input_port_0/value6316361" type="Const" version="opset1">
			<data offset="4" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="96" name="229122956529" type="Const" version="opset1">
			<data offset="10212" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="97" name="229222966424" type="Const" version="opset1">
			<data offset="10214" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="98" name="229322977141" type="Const" version="opset1">
			<data offset="10212" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="99" name="229422986952" type="Const" version="opset1">
			<data offset="10214" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="100" name="InstanceNormalization_11/Range_input_port_0/value4156643" type="Const" version="opset1">
			<data offset="4" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="101" name="167116756664" type="Const" version="opset1">
			<data offset="10216" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="102" name="167216767222" type="Const" version="opset1">
			<data offset="10218" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="103" name="167316776451" type="Const" version="opset1">
			<data offset="10216" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="104" name="167416786769" type="Const" version="opset1">
			<data offset="10218" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="105" name="InstanceNormalization_8/Range_input_port_0/value3976751" type="Const" version="opset1">
			<data offset="4" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="106" name="MaxPool_6" type="MaxPool" version="opset1">
			<data strides="2,2" kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="89">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="down_1.convs.conv_0.conv.weight3933602/quantized42437180" type="Const" version="opset1">
			<data offset="10220" size="9216" shape="32,32,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="down_1.convs.conv_0.conv.weight3933602/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_7/WithoutBiases/fq_weights_1/zero_point42626886" type="Const" version="opset1">
			<data offset="19436" size="64" shape="32,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_7/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_7/WithoutBiases/fq_weights_1/scale42517228" type="Const" version="opset1">
			<data offset="19500" size="64" shape="32,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_7/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_7/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_7/Dims28073956379" type="Const" version="opset1">
			<data offset="19564" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="90">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="InstanceNormalization_8/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="InstanceNormalization_8/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="InstanceNormalization_8/Rank/0d_rank_of/value4007186" type="Const" version="opset1">
			<data offset="508" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="InstanceNormalization_8/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="120" name="InstanceNormalization_8/Range_input_port_2/value4027138" type="Const" version="opset1">
			<data offset="516" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="121" name="InstanceNormalization_8/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0"/>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="175117557243" type="Const" version="opset1">
			<data offset="19628" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="123" name="175217566787" type="Const" version="opset1">
			<data offset="19630" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="124" name="175317577261" type="Const" version="opset1">
			<data offset="19628" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="125" name="175417587018" type="Const" version="opset1">
			<data offset="19630" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="126" name="InstanceNormalization_8/Ins_Norm/MVN_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="InstanceNormalization_8/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.999999747378752e-06" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="down_1.convs.conv_0.adn.N.weight4056211" type="Const" version="opset1">
			<data offset="19632" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="down_1.convs.conv_0.adn.N.weight">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="InstanceNormalization_8/Ins_Norm/mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="down_1.convs.conv_0.adn.N.bias4076532" type="Const" version="opset1">
			<data offset="19696" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="down_1.convs.conv_0.adn.N.bias">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="InstanceNormalization_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="91">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="LeakyRelu_9/weights703210867409" type="Const" version="opset1">
			<data offset="656" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="LeakyRelu_9" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="92">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Conv_10/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="down_1.convs.conv_1.conv.weight4113610/quantized43637078" type="Const" version="opset1">
			<data offset="19760" size="9216" shape="32,32,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="down_1.convs.conv_1.conv.weight4113610/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Conv_10/WithoutBiases/fq_weights_1/zero_point43826601" type="Const" version="opset1">
			<data offset="28976" size="64" shape="32,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Conv_10/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Conv_10/WithoutBiases/fq_weights_1/scale43716520" type="Const" version="opset1">
			<data offset="29040" size="64" shape="32,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="Conv_10/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="Conv_10/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="Conv_10/Dims27774136616" type="Const" version="opset1">
			<data offset="29104" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="Conv_10" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="93">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="InstanceNormalization_11/Rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="InstanceNormalization_11/Rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="InstanceNormalization_11/Rank/0d_rank_of/value4186337" type="Const" version="opset1">
			<data offset="508" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="InstanceNormalization_11/Rank" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="148" name="InstanceNormalization_11/Range_input_port_2/value4207123" type="Const" version="opset1">
			<data offset="516" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="149" name="InstanceNormalization_11/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0"/>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="130113056808" type="Const" version="opset1">
			<data offset="29168" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="151" name="130213066256" type="Const" version="opset1">
			<data offset="29170" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="152" name="130313076934" type="Const" version="opset1">
			<data offset="29168" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="153" name="130413086526" type="Const" version="opset1">
			<data offset="29170" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="154" name="InstanceNormalization_11/Ins_Norm/MVN_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="155" name="InstanceNormalization_11/Ins_Norm/MVN_" type="MVN" version="opset6">
			<data eps="9.999999747378752e-06" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="down_1.convs.conv_1.adn.N.weight4237075" type="Const" version="opset1">
