<?xml version="1.0" ?>
<net name="person-vehicle-bike-detection-2003" version="10">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 3, 480, 864"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>864</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="799" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1, 3, 4" size="48"/>
			<output>
				<port id="0" names="799" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="ConstantOfShape_383/Broadcast/FillValue" type="Const" version="opset1">
			<data element_type="i64" offset="48" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="image/scale_copy" type="Const" version="opset1">
			<data element_type="f32" offset="56" shape="32, 3, 3, 3" size="3456"/>
			<output>
				<port id="0" names="backbone.features.init_block.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_6" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>864</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_47057" type="Const" version="opset1">
			<data element_type="f32" offset="3512" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="BatchNormalization_7/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="371" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Clip_8" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" names="372" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="BatchNormalization_10/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="3640" shape="32, 32, 1, 1" size="4096"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit1.conv1.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_9" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_4706047065" type="Const" version="opset1">
			<data element_type="f32" offset="7736" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="BatchNormalization_10/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="374" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Clip_11" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" names="375" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="BatchNormalization_13/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="7864" shape="32, 1, 1, 3, 3" size="1152"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit1.conv2.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_12" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="data_add_4706847073" type="Const" version="opset1">
			<data element_type="f32" offset="9016" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="BatchNormalization_13/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="377" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Clip_14" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" names="378" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="BatchNormalization_16/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="9144" shape="16, 32, 1, 1" size="2048"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit1.conv3.conv.weight" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_15" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="data_add_4707647081" type="Const" version="opset1">
			<data element_type="f32" offset="11192" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="BatchNormalization_16/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="380" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="BatchNormalization_18/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="11256" shape="96, 16, 1, 1" size="6144"/>
			<output>
				<port id="0" names="backbone.features.stage2.unit1.conv1.conv.weight" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_17" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_4708447089" type="Const" version="opset1">
			<data element_type="f32" offset="17400" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="BatchNormalization_18/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="382" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Clip_19" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" names="383" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="BatchNormalization_21/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="17784" shape="96, 1, 1, 3, 3" size="3456"/>
			<output>
				<port id="0" names="backbone.features.stage2.unit1.conv2.conv.weight" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_20" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>240</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="data_add_4709247097" type="Const" version="opset1">
			<data element_type="f32" offset="21240" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="BatchNormalization_21/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="385" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Clip_22" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" names="386" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="BatchNormalization_24/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="21624" shape="24, 96, 1, 1" size="9216"/>
			<output>
				<port id="0" names="backbone.features.stage2.unit1.conv3.conv.weight" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_23" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="data_add_4710047105" type="Const" version="opset1">
			<data element_type="f32" offset="30840" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="BatchNormalization_24/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="388" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="BatchNormalization_26/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="30936" shape="144, 24, 1, 1" size="13824"/>
			<output>
				<port id="0" names="backbone.features.stage2.unit2.conv1.conv.weight" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_25" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_4710847113" type="Const" version="opset1">
			<data element_type="f32" offset="44760" shape="1, 144, 1, 1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="BatchNormalization_26/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="390" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Clip_27" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" names="391" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="BatchNormalization_29/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="45336" shape="144, 1, 1, 3, 3" size="5184"/>
			<output>
				<port id="0" names="backbone.features.stage2.unit2.conv2.conv.weight" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_28" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_4711647121" type="Const" version="opset1">
			<data element_type="f32" offset="50520" shape="1, 144, 1, 1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="BatchNormalization_29/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="393" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Clip_30" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" names="394" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="BatchNormalization_32/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="51096" shape="24, 144, 1, 1" size="13824"/>
			<output>
				<port id="0" names="backbone.features.stage2.unit2.conv3.conv.weight" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_31" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="data_add_4712447129" type="Const" version="opset1">
			<data element_type="f32" offset="64920" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="BatchNormalization_32/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="396" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Add_33" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="2" names="397" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="BatchNormalization_35/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="65016" shape="144, 24, 1, 1" size="13824"/>
			<output>
				<port id="0" names="backbone.features.stage3.unit1.conv1.conv.weight" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_34" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_add_4713247137" type="Const" version="opset1">
			<data element_type="f32" offset="78840" shape="1, 144, 1, 1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="BatchNormalization_35/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="399" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Clip_36" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" names="400" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="BatchNormalization_38/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="79416" shape="144, 1, 1, 3, 3" size="5184"/>
			<output>
				<port id="0" names="backbone.features.stage3.unit1.conv2.conv.weight" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_37" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>120</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_4714047145" type="Const" version="opset1">
			<data element_type="f32" offset="84600" shape="1, 144, 1, 1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="BatchNormalization_38/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="402" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Clip_39" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" names="403" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="BatchNormalization_41/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="85176" shape="32, 144, 1, 1" size="18432"/>
			<output>
				<port id="0" names="backbone.features.stage3.unit1.conv3.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_40" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="data_add_4714847153" type="Const" version="opset1">
			<data element_type="f32" offset="103608" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="BatchNormalization_41/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="405" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="BatchNormalization_43/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="103736" shape="192, 32, 1, 1" size="24576"/>
			<output>
				<port id="0" names="backbone.features.stage3.unit2.conv1.conv.weight" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_42" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_4715647161" type="Const" version="opset1">
			<data element_type="f32" offset="128312" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="BatchNormalization_43/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="407" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Clip_44" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" names="408" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="BatchNormalization_46/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="129080" shape="192, 1, 1, 3, 3" size="6912"/>
			<output>
				<port id="0" names="backbone.features.stage3.unit2.conv2.conv.weight" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_45" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="data_add_4716447169" type="Const" version="opset1">
			<data element_type="f32" offset="135992" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="BatchNormalization_46/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="410" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Clip_47" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" names="411" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="BatchNormalization_49/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="136760" shape="32, 192, 1, 1" size="24576"/>
			<output>
				<port id="0" names="backbone.features.stage3.unit2.conv3.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_48" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="data_add_4717247177" type="Const" version="opset1">
			<data element_type="f32" offset="161336" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="BatchNormalization_49/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="413" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Add_50" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="2" names="414" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="BatchNormalization_52/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="161464" shape="192, 32, 1, 1" size="24576"/>
			<output>
				<port id="0" names="backbone.features.stage3.unit3.conv1.conv.weight" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_51" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="data_add_4718047185" type="Const" version="opset1">
			<data element_type="f32" offset="186040" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="BatchNormalization_52/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="416" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Clip_53" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" names="417" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="BatchNormalization_55/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="186808" shape="192, 1, 1, 3, 3" size="6912"/>
			<output>
				<port id="0" names="backbone.features.stage3.unit3.conv2.conv.weight" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_54" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="data_add_4718847193" type="Const" version="opset1">
			<data element_type="f32" offset="193720" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="BatchNormalization_55/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="419" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Clip_56" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" names="420" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="BatchNormalization_58/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="194488" shape="32, 192, 1, 1" size="24576"/>
			<output>
				<port id="0" names="backbone.features.stage3.unit3.conv3.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_57" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="data_add_4719647201" type="Const" version="opset1">
			<data element_type="f32" offset="219064" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="BatchNormalization_58/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="422" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Add_59" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="2" names="423" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="neck.lateral_convs.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="219192" shape="32, 32, 1, 1" size="4096"/>
			<output>
				<port id="0" names="neck.lateral_convs.0.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_155/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_155/Dims28399" type="Const" version="opset1">
			<data element_type="f32" offset="223288" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_155" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="519" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="BatchNormalization_61/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="223416" shape="192, 32, 1, 1" size="24576"/>
			<output>
				<port id="0" names="backbone.features.stage4.unit1.conv1.conv.weight" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_60" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="data_add_4720447209" type="Const" version="opset1">
			<data element_type="f32" offset="247992" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="BatchNormalization_61/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="425" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Clip_62" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" names="426" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="BatchNormalization_64/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="248760" shape="192, 1, 1, 3, 3" size="6912"/>
			<output>
				<port id="0" names="backbone.features.stage4.unit1.conv2.conv.weight" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_63" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>60</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>30</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="data_add_4721247217" type="Const" version="opset1">
			<data element_type="f32" offset="255672" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="BatchNormalization_64/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>30</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="428" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>30</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Clip_65" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>30</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1" names="429" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>30</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="BatchNormalization_67/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="256440" shape="64, 192, 1, 1" size="49152"/>
